from django.utils.translation import ugettext_lazy as _


CITIES = (
        ('msk', _('Москва')),
        ('spb', _('Санкт-петербург')),
        ('mhk', _('Махачкала')),
        ('mhk', _('Каспийск')),
        ('drb', _('Дербент')),
        ('kzl', _('Кизляр')),
        ('hsv', _('Хасавюрт')),
    )

SPECIALITIES = (
        ('bkd', _('бекенд-разработчик')),
        ('frd', _('фронтенд-разработчик')),
        ('and', _('android-разработчик')),
        ('ios', _('ios-разработчик')),
        ('dsn', _('дизайнер')),
        ('vrk', _('верстальщик')),
        ('dsp', _('десктоп-разработчик')),
    )

EVENT_TYPE = (
        ('kon', _('Конференция')),
        ('lek', _('Лекция')),
        ('hak', _('Хакатон')),
    )

PROJECT_TYPE = (
        ('kon', _('Open Soucre')),
        ('lek', _('Социальный')),
        ('hak', _('Коммерческий')),
    )